maxgerhardt/framework-aurduino/ShieldBuddyTC375/aurix/system/libaurix/include/intids_tc37x.h
/*====================================================================
* Project:  Board Support Package (BSP)
* Function: Interrupt Service Node IDs on TC37x
*
* Copyright HighTec EDV-Systeme GmbH 1982-2019
*====================================================================*/

#ifndef __INTIDS_TC37X_H__
#define __INTIDS_TC37X_H__

/* Interrupt SRC IDs */
#define SRC_ID_CPU0SB			0	/* CPU 0 Software Breakpoint Service Request */
#define SRC_ID_CPU1SB			1	/* CPU 1 Software Breakpoint Service Request */
#define SRC_ID_CPU2SB			2	/* CPU 2 Software Breakpoint Service Request */

#define SRC_ID_BCUSPB			8	/* Bus Control Unit SPB Service Request */
#define SRC_ID_BCUBBB			9	/* Bus Control Unit BBB Service Request (ED only) */

#define SRC_ID_AGBT				11	/* AGBT Service Request (ED only) */

#define SRC_ID_XBAR0			12	/* Domain 0 XBAR_SRI Service Request */
#define SRC_ID_XBAR2			14	/* Domain 2 XBAR_SRI Service Request */

#define SRC_ID_CERBERUS0		16	/* Cerberus Service Request 0 */
#define SRC_ID_CERBERUS1		17	/* Cerberus Service Request 1 */

#define SRC_ID_ASCLIN0TX		20	/* ASCLIN 0 Transmit Service Request */
#define SRC_ID_ASCLIN0RX		21	/* ASCLIN 0 Receive Service Request */
#define SRC_ID_ASCLIN0EX		22	/* ASCLIN 0 Error Service Request */
#define SRC_ID_ASCLIN1TX		23	/* ASCLIN 1 Transmit Service Request */
#define SRC_ID_ASCLIN1RX		24	/* ASCLIN 1 Receive Service Request */
#define SRC_ID_ASCLIN1EX		25	/* ASCLIN 1 Error Service Request */
#define SRC_ID_ASCLIN2TX		26	/* ASCLIN 2 Transmit Service Request */
#define SRC_ID_ASCLIN2RX		27	/* ASCLIN 2 Receive Service Request */
#define SRC_ID_ASCLIN2EX		28	/* ASCLIN 2 Error Service Request */
#define SRC_ID_ASCLIN3TX		29	/* ASCLIN 3 Transmit Service Request */
#define SRC_ID_ASCLIN3RX		30	/* ASCLIN 3 Receive Service Request */
#define SRC_ID_ASCLIN3EX		31	/* ASCLIN 3 Error Service Request */
#define SRC_ID_ASCLIN4TX		32	/* ASCLIN 4 Transmit Service Request */
#define SRC_ID_ASCLIN4RX		33	/* ASCLIN 4 Receive Service Request */
#define SRC_ID_ASCLIN4EX		34	/* ASCLIN 4 Error Service Request */
#define SRC_ID_ASCLIN5TX		35	/* ASCLIN 5 Transmit Service Request */
#define SRC_ID_ASCLIN5RX		36	/* ASCLIN 5 Receive Service Request */
#define SRC_ID_ASCLIN5EX		37	/* ASCLIN 5 Error Service Request */
#define SRC_ID_ASCLIN6TX		38	/* ASCLIN 6 Transmit Service Request */
#define SRC_ID_ASCLIN6RX		39	/* ASCLIN 6 Receive Service Request */
#define SRC_ID_ASCLIN6EX		40	/* ASCLIN 6 Error Service Request */
#define SRC_ID_ASCLIN7TX		41	/* ASCLIN 7 Transmit Service Request */
#define SRC_ID_ASCLIN7RX		42	/* ASCLIN 7 Receive Service Request */
#define SRC_ID_ASCLIN7EX		43	/* ASCLIN 7 Error Service Request */
#define SRC_ID_ASCLIN8TX		44	/* ASCLIN 8 Transmit Service Request */
#define SRC_ID_ASCLIN8RX		45	/* ASCLIN 8 Receive Service Request */
#define SRC_ID_ASCLIN8EX		46	/* ASCLIN 8 Error Service Request */
#define SRC_ID_ASCLIN9TX		47	/* ASCLIN 9 Transmit Service Request */
#define SRC_ID_ASCLIN9RX		48	/* ASCLIN 9 Receive Service Request */
#define SRC_ID_ASCLIN9EX		49	/* ASCLIN 9 Error Service Request */
#define SRC_ID_ASCLIN10TX		50	/* ASCLIN 10 Transmit Service Request */
#define SRC_ID_ASCLIN10RX		51	/* ASCLIN 10 Receive Service Request */
#define SRC_ID_ASCLIN10EX		52	/* ASCLIN 10 Error Service Request */
#define SRC_ID_ASCLIN11TX		53	/* ASCLIN 11 Transmit Service Request */
#define SRC_ID_ASCLIN11RX		54	/* ASCLIN 11 Receive Service Request */
#define SRC_ID_ASCLIN11EX		55	/* ASCLIN 11 Error Service Request */

#define SRC_ID_MTUDONE			59	/* MTU Done Service Request */

#define SRC_ID_QSPI0TX			60	/* QSPI 0 Transmit Service Request */
#define SRC_ID_QSPI0RX			61	/* QSPI 0 Receive Service Request */
#define SRC_ID_QSPI0ERR			62	/* QSPI 0 Error Service Request */
#define SRC_ID_QSPI0PT			63	/* QSPI 0 Phase Transition Service Request */
#define SRC_ID_QSPI0U			64	/* QSPI 0 User Defined Service Request */
#define SRC_ID_QSPI1TX			65	/* QSPI 1 Transmit Service Request */
#define SRC_ID_QSPI1RX			66	/* QSPI 1 Receive Service Request */
#define SRC_ID_QSPI1ERR			67	/* QSPI 1 Error Service Request */
#define SRC_ID_QSPI1PT			68	/* QSPI 1 Phase Transition Service Request */
#define SRC_ID_QSPI1U			69	/* QSPI 1 User Defined Service Request */
#define SRC_ID_QSPI2TX			70	/* QSPI 2 Transmit Service Request */
#define SRC_ID_QSPI2RX			71	/* QSPI 2 Receive Service Request */
#define SRC_ID_QSPI2ERR			72	/* QSPI 2 Error Service Request */
#define SRC_ID_QSPI2PT			73	/* QSPI 2 Phase Transition Service Request */
#define SRC_ID_QSPI2U			74	/* QSPI 2 User Defined Service Request */
#define SRC_ID_QSPI3TX			75	/* QSPI 3 Transmit Service Request */
#define SRC_ID_QSPI3RX			76	/* QSPI 3 Receive Service Request */
#define SRC_ID_QSPI3ERR			77	/* QSPI 3 Error Service Request */
#define SRC_ID_QSPI3PT			78	/* QSPI 3 Phase Transition Service Request */
#define SRC_ID_QSPI3U			79	/* QSPI 3 User Defined Service Request */
#define SRC_ID_QSPI4TX			80	/* QSPI 4 Transmit Service Request */
#define SRC_ID_QSPI4RX			81	/* QSPI 4 Receive Service Request */
#define SRC_ID_QSPI4ERR			82	/* QSPI 4 Error Service Request */
#define SRC_ID_QSPI4PT			83	/* QSPI 4 Phase Transition Service Request */
#define SRC_ID_QSPI4U			84	/* QSPI 4 User Defined Service Request */

#define SRC_ID_HSCT0			96	/* HSCT0 Service Request */

#define SRC_ID_HSSL0COK0		100	/* HSSL0 Channel 0 OK Service Request */
#define SRC_ID_HSSL0RDI0		101	/* HSSL0 Channel 0 Read Data Service Request */
#define SRC_ID_HSSL0ERR0		102	/* HSSL0 Channel 0 Error Service Request */
#define SRC_ID_HSSL0TRG0		103	/* HSSL0 Channel 0 Trigger Service Request */
#define SRC_ID_HSSL0COK1		104	/* HSSL0 Channel 1 OK Service Request */
#define SRC_ID_HSSL0RDI1		105	/* HSSL0 Channel 1 Read Data Service Request */
#define SRC_ID_HSSL0ERR1		106	/* HSSL0 Channel 1 Error Service Request */
#define SRC_ID_HSSL0TRG1		107	/* HSSL0 Channel 1 Trigger Service Request */
#define SRC_ID_HSSL0COK2		108	/* HSSL0 Channel 2 OK Service Request */
#define SRC_ID_HSSL0RDI2		109	/* HSSL0 Channel 2 Read Data Service Request */
#define SRC_ID_HSSL0ERR2		110	/* HSSL0 Channel 2 Error Service Request */
#define SRC_ID_HSSL0TRG2		111	/* HSSL0 Channel 2 Trigger Service Request */
#define SRC_ID_HSSL0COK3		112	/* HSSL0 Channel 3 OK Service Request */
#define SRC_ID_HSSL0RDI3		113	/* HSSL0 Channel 3 Read Data Service Request */
#define SRC_ID_HSSL0ERR3		114	/* HSSL0 Channel 3 Error Service Request */
#define SRC_ID_HSSL0TRG3		115	/* HSSL0 Channel 3 Trigger Service Request */
#define SRC_ID_HSSL0EXI			116	/* HSSL0 Exception Service Request */

#define SRC_ID_GETH1_0			117	/* GETH1 Service Request 0 */
#define SRC_ID_GETH1_1			118	/* GETH1 Service Request 1 */
#define SRC_ID_GETH1_2			119	/* GETH1 Service Request 2 */
#define SRC_ID_GETH1_3			120	/* GETH1 Service Request 3 */
#define SRC_ID_GETH1_4			121	/* GETH1 Service Request 4 */
#define SRC_ID_GETH1_5			122	/* GETH1 Service Request 5 */
#define SRC_ID_GETH1_6			123	/* GETH1 Service Request 6 */
#define SRC_ID_GETH1_7			124	/* GETH1 Service Request 7 */
#define SRC_ID_GETH1_8			125	/* GETH1 Service Request 8 */
#define SRC_ID_GETH1_9			126	/* GETH1 Service Request 9 */

#define SRC_ID_I2C0DTR			136	/* I2C 0 Data Transfer Request */
#define SRC_ID_I2C0ERR			137	/* I2C 0 Error Service Request */
#define SRC_ID_I2C0P			138	/* I2C 0 Protocol Service Request */

