maxgerhardt/framework-aurduino/ShieldBuddyTC375/aurix/system/libaurix/include/intids_tc37x.h
#define SRC_ID_SENT0			144	/* SENT TRIG0 Service Request */
#define SRC_ID_SENT1			145	/* SENT TRIG1 Service Request */
#define SRC_ID_SENT2			146	/* SENT TRIG2 Service Request */
#define SRC_ID_SENT3			147	/* SENT TRIG3 Service Request */
#define SRC_ID_SENT4			148	/* SENT TRIG4 Service Request */
#define SRC_ID_SENT5			149	/* SENT TRIG5 Service Request */
#define SRC_ID_SENT6			150	/* SENT TRIG6 Service Request */
#define SRC_ID_SENT7			151	/* SENT TRIG7 Service Request */
#define SRC_ID_SENT8			152	/* SENT TRIG8 Service Request */
#define SRC_ID_SENT9			153	/* SENT TRIG9 Service Request */

#define SRC_ID_MSC0SR0			156	/* MSC 0 Service Request 0 */
#define SRC_ID_MSC0SR1			157	/* MSC 0 Service Request 1 */
#define SRC_ID_MSC0SR2			158	/* MSC 0 Service Request 2 */
#define SRC_ID_MSC0SR3			159	/* MSC 0 Service Request 3 */
#define SRC_ID_MSC0SR4			160	/* MSC 0 Service Request 4 */
#define SRC_ID_MSC1SR0			161	/* MSC 1 Service Request 0 */
#define SRC_ID_MSC1SR1			162	/* MSC 1 Service Request 1 */
#define SRC_ID_MSC1SR2			163	/* MSC 1 Service Request 2 */
#define SRC_ID_MSC1SR3			164	/* MSC 1 Service Request 3 */
#define SRC_ID_MSC1SR4			165	/* MSC 1 Service Request 4 */

#define SRC_ID_CCU60SR0			176	/* CCU6 0 Service Request 0 */
#define SRC_ID_CCU60SR1			177	/* CCU6 0 Service Request 1 */
#define SRC_ID_CCU60SR2			178	/* CCU6 0 Service Request 2 */
#define SRC_ID_CCU60SR3			179	/* CCU6 0 Service Request 3 */
#define SRC_ID_CCU61SR0			180	/* CCU6 1 Service Request 0 */
#define SRC_ID_CCU61SR1			181	/* CCU6 1 Service Request 1 */
#define SRC_ID_CCU61SR2			182	/* CCU6 1 Service Request 2 */
#define SRC_ID_CCU61SR3			183	/* CCU6 1 Service Request 3 */

#define SRC_ID_GPT120CIRQ		184	/* GPT120 CAPREL Service Request */
#define SRC_ID_GPT120T2			185	/* GPT120 T2 Overflow/Underflow Service Request */
#define SRC_ID_GPT120T3			186	/* GPT120 T3 Overflow/Underflow Service Request */
#define SRC_ID_GPT120T4			187	/* GPT120 T4 Overflow/Underflow Service Request */
#define SRC_ID_GPT120T5			188	/* GPT120 T5 Overflow/Underflow Service Request */
#define SRC_ID_GPT120T6			189	/* GPT120 T6 Overflow/Underflow Service Request */

#define SRC_ID_STM0SR0			192	/* System Timer 0 Service Request 0 */
#define SRC_ID_STM0SR1			193	/* System Timer 0 Service Request 1 */
#define SRC_ID_STM1SR0			194	/* System Timer 1 Service Request 0 */
#define SRC_ID_STM1SR1			195	/* System Timer 1 Service Request 1 */
#define SRC_ID_STM2SR0			196	/* System Timer 2 Service Request 0 */
#define SRC_ID_STM2SR1			197	/* System Timer 2 Service Request 1 */

#define SRC_ID_FCE0				204	/* FCE0 Error Service Request */

#define SRC_ID_DMAERR0			208	/* DMA Error Service Request 0 */
#define SRC_ID_DMAERR1			209	/* DMA Error Service Request 1 */
#define SRC_ID_DMAERR2			210	/* DMA Error Service Request 2 */
#define SRC_ID_DMAERR3			211	/* DMA Error Service Request 3 */

#define SRC_ID_DMACH0			220	/* DMA Channel   0 Service Request */
#define SRC_ID_DMACH1			221	/* DMA Channel   1 Service Request */
#define SRC_ID_DMACH2			222	/* DMA Channel   2 Service Request */
#define SRC_ID_DMACH3			223	/* DMA Channel   3 Service Request */
#define SRC_ID_DMACH4			224	/* DMA Channel   4 Service Request */
#define SRC_ID_DMACH5			225	/* DMA Channel   5 Service Request */
#define SRC_ID_DMACH6			226	/* DMA Channel   6 Service Request */
#define SRC_ID_DMACH7			227	/* DMA Channel   7 Service Request */
#define SRC_ID_DMACH8			228	/* DMA Channel   8 Service Request */
#define SRC_ID_DMACH9			229	/* DMA Channel   9 Service Request */
#define SRC_ID_DMACH10			230	/* DMA Channel  10 Service Request */
#define SRC_ID_DMACH11			231	/* DMA Channel  11 Service Request */
#define SRC_ID_DMACH12			232	/* DMA Channel  12 Service Request */
#define SRC_ID_DMACH13			233	/* DMA Channel  13 Service Request */
#define SRC_ID_DMACH14			234	/* DMA Channel  14 Service Request */
#define SRC_ID_DMACH15			235	/* DMA Channel  15 Service Request */
#define SRC_ID_DMACH16			236	/* DMA Channel  16 Service Request */
#define SRC_ID_DMACH17			237	/* DMA Channel  17 Service Request */
#define SRC_ID_DMACH18			238	/* DMA Channel  18 Service Request */
#define SRC_ID_DMACH19			239	/* DMA Channel  19 Service Request */
#define SRC_ID_DMACH20			240	/* DMA Channel  20 Service Request */
#define SRC_ID_DMACH21			241	/* DMA Channel  21 Service Request */
#define SRC_ID_DMACH22			242	/* DMA Channel  22 Service Request */
#define SRC_ID_DMACH23			243	/* DMA Channel  23 Service Request */
#define SRC_ID_DMACH24			244	/* DMA Channel  24 Service Request */
#define SRC_ID_DMACH25			245	/* DMA Channel  25 Service Request */
#define SRC_ID_DMACH26			246	/* DMA Channel  26 Service Request */
#define SRC_ID_DMACH27			247	/* DMA Channel  27 Service Request */
#define SRC_ID_DMACH28			248	/* DMA Channel  28 Service Request */
#define SRC_ID_DMACH29			249	/* DMA Channel  29 Service Request */
#define SRC_ID_DMACH30			250	/* DMA Channel  30 Service Request */
#define SRC_ID_DMACH31			251	/* DMA Channel  31 Service Request */
#define SRC_ID_DMACH32			252	/* DMA Channel  32 Service Request */
#define SRC_ID_DMACH33			253	/* DMA Channel  33 Service Request */
#define SRC_ID_DMACH34			254	/* DMA Channel  34 Service Request */
#define SRC_ID_DMACH35			255	/* DMA Channel  35 Service Request */
#define SRC_ID_DMACH36			256	/* DMA Channel  36 Service Request */
#define SRC_ID_DMACH37			257	/* DMA Channel  37 Service Request */
#define SRC_ID_DMACH38			258	/* DMA Channel  38 Service Request */
#define SRC_ID_DMACH39			259	/* DMA Channel  39 Service Request */
#define SRC_ID_DMACH40			260	/* DMA Channel  40 Service Request */
#define SRC_ID_DMACH41			261	/* DMA Channel  41 Service Request */
#define SRC_ID_DMACH42			262	/* DMA Channel  42 Service Request */
#define SRC_ID_DMACH43			263	/* DMA Channel  43 Service Request */
#define SRC_ID_DMACH44			264	/* DMA Channel  44 Service Request */
#define SRC_ID_DMACH45			265	/* DMA Channel  45 Service Request */
#define SRC_ID_DMACH46			266	/* DMA Channel  46 Service Request */
#define SRC_ID_DMACH47			267	/* DMA Channel  47 Service Request */
#define SRC_ID_DMACH48			268	/* DMA Channel  48 Service Request */
#define SRC_ID_DMACH49			269	/* DMA Channel  49 Service Request */
#define SRC_ID_DMACH50			270	/* DMA Channel  50 Service Request */
#define SRC_ID_DMACH51			271	/* DMA Channel  51 Service Request */
#define SRC_ID_DMACH52			272	/* DMA Channel  52 Service Request */
#define SRC_ID_DMACH53			273	/* DMA Channel  53 Service Request */
#define SRC_ID_DMACH54			274	/* DMA Channel  54 Service Request */
#define SRC_ID_DMACH55			275	/* DMA Channel  55 Service Request */
#define SRC_ID_DMACH56			276	/* DMA Channel  56 Service Request */
#define SRC_ID_DMACH57			277	/* DMA Channel  57 Service Request */
#define SRC_ID_DMACH58			278	/* DMA Channel  58 Service Request */
#define SRC_ID_DMACH59			279	/* DMA Channel  59 Service Request */
#define SRC_ID_DMACH60			280	/* DMA Channel  60 Service Request */
#define SRC_ID_DMACH61			281	/* DMA Channel  61 Service Request */
#define SRC_ID_DMACH62			282	/* DMA Channel  62 Service Request */
#define SRC_ID_DMACH63			283	/* DMA Channel  63 Service Request */
#define SRC_ID_DMACH64			284	/* DMA Channel  64 Service Request */
#define SRC_ID_DMACH65			285	/* DMA Channel  65 Service Request */
#define SRC_ID_DMACH66			286	/* DMA Channel  66 Service Request */
#define SRC_ID_DMACH67			287	/* DMA Channel  67 Service Request */
#define SRC_ID_DMACH68			288	/* DMA Channel  68 Service Request */
#define SRC_ID_DMACH69			289	/* DMA Channel  69 Service Request */
#define SRC_ID_DMACH70			290	/* DMA Channel  70 Service Request */
#define SRC_ID_DMACH71			291	/* DMA Channel  71 Service Request */
#define SRC_ID_DMACH72			292	/* DMA Channel  72 Service Request */
#define SRC_ID_DMACH73			293	/* DMA Channel  73 Service Request */
#define SRC_ID_DMACH74			294	/* DMA Channel  74 Service Request */
#define SRC_ID_DMACH75			295	/* DMA Channel  75 Service Request */
#define SRC_ID_DMACH76			296	/* DMA Channel  76 Service Request */
#define SRC_ID_DMACH77			297	/* DMA Channel  77 Service Request */
#define SRC_ID_DMACH78			298	/* DMA Channel  78 Service Request */
#define SRC_ID_DMACH79			299	/* DMA Channel  79 Service Request */
#define SRC_ID_DMACH80			300	/* DMA Channel  80 Service Request */
#define SRC_ID_DMACH81			301	/* DMA Channel  81 Service Request */
#define SRC_ID_DMACH82			302	/* DMA Channel  82 Service Request */
#define SRC_ID_DMACH83			303	/* DMA Channel  83 Service Request */
#define SRC_ID_DMACH84			304	/* DMA Channel  84 Service Request */
#define SRC_ID_DMACH85			305	/* DMA Channel  85 Service Request */
#define SRC_ID_DMACH86			306	/* DMA Channel  86 Service Request */
#define SRC_ID_DMACH87			307	/* DMA Channel  87 Service Request */
#define SRC_ID_DMACH88			308	/* DMA Channel  88 Service Request */
#define SRC_ID_DMACH89			309	/* DMA Channel  89 Service Request */
#define SRC_ID_DMACH90			310	/* DMA Channel  90 Service Request */
#define SRC_ID_DMACH91			311	/* DMA Channel  91 Service Request */
#define SRC_ID_DMACH92			312	/* DMA Channel  92 Service Request */
#define SRC_ID_DMACH93			313	/* DMA Channel  93 Service Request */
#define SRC_ID_DMACH94			314	/* DMA Channel  94 Service Request */
#define SRC_ID_DMACH95			315	/* DMA Channel  95 Service Request */
#define SRC_ID_DMACH96			316	/* DMA Channel  96 Service Request */
#define SRC_ID_DMACH97			317	/* DMA Channel  97 Service Request */
#define SRC_ID_DMACH98			318	/* DMA Channel  98 Service Request */
#define SRC_ID_DMACH99			319	/* DMA Channel  99 Service Request */
#define SRC_ID_DMACH100			320	/* DMA Channel 100 Service Request */
#define SRC_ID_DMACH101			321	/* DMA Channel 101 Service Request */
#define SRC_ID_DMACH102			322	/* DMA Channel 102 Service Request */
#define SRC_ID_DMACH103			323	/* DMA Channel 103 Service Request */
#define SRC_ID_DMACH104			324	/* DMA Channel 104 Service Request */
#define SRC_ID_DMACH105			325	/* DMA Channel 105 Service Request */
#define SRC_ID_DMACH106			326	/* DMA Channel 106 Service Request */
#define SRC_ID_DMACH107			327	/* DMA Channel 107 Service Request */
#define SRC_ID_DMACH108			328	/* DMA Channel 108 Service Request */
#define SRC_ID_DMACH109			329	/* DMA Channel 109 Service Request */
#define SRC_ID_DMACH110			330	/* DMA Channel 110 Service Request */
#define SRC_ID_DMACH111			331	/* DMA Channel 111 Service Request */
#define SRC_ID_DMACH112			332	/* DMA Channel 112 Service Request */
#define SRC_ID_DMACH113			333	/* DMA Channel 113 Service Request */
#define SRC_ID_DMACH114			334	/* DMA Channel 114 Service Request */
#define SRC_ID_DMACH115			335	/* DMA Channel 115 Service Request */
#define SRC_ID_DMACH116			336	/* DMA Channel 116 Service Request */
#define SRC_ID_DMACH117			337	/* DMA Channel 117 Service Request */
#define SRC_ID_DMACH118			338	/* DMA Channel 118 Service Request */
#define SRC_ID_DMACH119			339	/* DMA Channel 119 Service Request */
#define SRC_ID_DMACH120			340	/* DMA Channel 120 Service Request */
#define SRC_ID_DMACH121			341	/* DMA Channel 121 Service Request */
#define SRC_ID_DMACH122			342	/* DMA Channel 122 Service Request */
#define SRC_ID_DMACH123			343	/* DMA Channel 123 Service Request */
#define SRC_ID_DMACH124			344	/* DMA Channel 124 Service Request */
#define SRC_ID_DMACH125			345	/* DMA Channel 125 Service Request */
#define SRC_ID_DMACH126			346	/* DMA Channel 126 Service Request */
#define SRC_ID_DMACH127			347	/* DMA Channel 127 Service Request */

