maxgerhardt/framework-aurduino/ShieldBuddyTC375/aurix/system/libaurix/include/intids_tc37x.h
#define SRC_ID_DMUHOST			536	/* DMU Host Service Request */
#define SRC_ID_DMUFSI			537	/* DMU FSI Service Request */

#define SRC_ID_HSM0				540	/* HSM Service Request 0 */
#define SRC_ID_HSM1				541	/* HSM Service Request 1 */

#define SRC_ID_SCUERU0			544	/* SCU ERU Service Request 0 */
#define SRC_ID_SCUERU1			545	/* SCU ERU Service Request 1 */
#define SRC_ID_SCUERU2			546	/* SCU ERU Service Request 2 */
#define SRC_ID_SCUERU3			547	/* SCU ERU Service Request 3 */

#define SRC_ID_PMSDTS			555	/* PMS DTS Service Request */
#define SRC_ID_PMS0				556	/* PMS Service Request 0 */
#define SRC_ID_PMS1				557	/* PMS Service Request 1 */
#define SRC_ID_PMS2				558	/* PMS Service Request 2 */
#define SRC_ID_PMS3				559	/* PMS Service Request 3 */
#define SRC_ID_SCR				560	/* Standby Controller (SCR) Service Request */

#define SRC_ID_SMU0				564	/* SMU Service Request 0 */
#define SRC_ID_SMU1				565	/* SMU Service Request 1 */
#define SRC_ID_SMU2				566	/* SMU Service Request 2 */

#define SRC_ID_PSI50			568	/* PSI5 Service Request 0 */
#define SRC_ID_PSI51			569	/* PSI5 Service Request 1 */
#define SRC_ID_PSI52			570	/* PSI5 Service Request 2 */
#define SRC_ID_PSI53			571	/* PSI5 Service Request 3 */
#define SRC_ID_PSI54			572	/* PSI5 Service Request 4 */
#define SRC_ID_PSI55			573	/* PSI5 Service Request 5 */
#define SRC_ID_PSI56			574	/* PSI5 Service Request 6 */
#define SRC_ID_PSI57			575	/* PSI5 Service Request 7 */

#define SRC_ID_DAM0LI0			580	/* DAM0 Limit 0 Service Request */
#define SRC_ID_DAM0RI0			581	/* DAM0 Ready 0 Service Request */
#define SRC_ID_DAM0LI1			582	/* DAM0 Limit 1 Service Request */
#define SRC_ID_DAM0RI1			583	/* DAM0 Ready 1 Service Request */
#define SRC_ID_DAM0DR			584	/* DAM0 DMA Ready Service Request */
#define SRC_ID_DAM0ERR			585	/* DAM0 Error Service Request */

#define SRC_ID_CIFMI			592	/* CIF MI Service Request */
#define SRC_ID_CIFMIEP			593	/* CIF MI EP Service Request */
#define SRC_ID_CIFISP			594	/* CIF ISP Service Request */
#define SRC_ID_CIFMJPEG			595	/* CIF MJPEG Service Request */

#define SRC_ID_PSI5S0			596	/* PSI5-S Service Request 0 */
#define SRC_ID_PSI5S1			597	/* PSI5-S Service Request 1 */
#define SRC_ID_PSI5S2			598	/* PSI5-S Service Request 2 */
#define SRC_ID_PSI5S3			599	/* PSI5-S Service Request 3 */
#define SRC_ID_PSI5S4			600	/* PSI5-S Service Request 4 */
#define SRC_ID_PSI5S5			601	/* PSI5-S Service Request 5 */
#define SRC_ID_PSI5S6			602	/* PSI5-S Service Request 6 */
#define SRC_ID_PSI5S7			603	/* PSI5-S Service Request 7 */

#define SRC_ID_GPSR00			612	/* General Purpose Service Request 0 0 */
#define SRC_ID_GPSR01			613	/* General Purpose Service Request 0 1 */
#define SRC_ID_GPSR02			614	/* General Purpose Service Request 0 2 */
#define SRC_ID_GPSR03			615	/* General Purpose Service Request 0 3 */
#define SRC_ID_GPSR04			616	/* General Purpose Service Request 0 4 */
#define SRC_ID_GPSR05			617	/* General Purpose Service Request 0 5 */
#define SRC_ID_GPSR06			618	/* General Purpose Service Request 0 6 */
#define SRC_ID_GPSR07			619	/* General Purpose Service Request 0 7 */

#define SRC_ID_GPSR10			620	/* General Purpose Service Request 1 0 */
#define SRC_ID_GPSR11			621	/* General Purpose Service Request 1 1 */
#define SRC_ID_GPSR12			622	/* General Purpose Service Request 1 2 */
#define SRC_ID_GPSR13			623	/* General Purpose Service Request 1 3 */
#define SRC_ID_GPSR14			624	/* General Purpose Service Request 1 4 */
#define SRC_ID_GPSR15			625	/* General Purpose Service Request 1 5 */
#define SRC_ID_GPSR16			626	/* General Purpose Service Request 1 6 */
#define SRC_ID_GPSR17			627	/* General Purpose Service Request 1 7 */

#define SRC_ID_GPSR20			628	/* General Purpose Service Request 2 0 */
#define SRC_ID_GPSR21			629	/* General Purpose Service Request 2 1 */
#define SRC_ID_GPSR22			630	/* General Purpose Service Request 2 2 */
#define SRC_ID_GPSR23			631	/* General Purpose Service Request 2 3 */
#define SRC_ID_GPSR24			632	/* General Purpose Service Request 2 4 */
#define SRC_ID_GPSR25			633	/* General Purpose Service Request 2 5 */
#define SRC_ID_GPSR26			634	/* General Purpose Service Request 2 6 */
#define SRC_ID_GPSR27			635	/* General Purpose Service Request 2 7 */

#define SRC_ID_GTMAEIIRQ		668	/* GTM AEI Shared Service Request */
#define SRC_ID_GTMARUIRQ0		669	/* GTM ARU Shared Service Request 0 */
#define SRC_ID_GTMARUIRQ1		670	/* GTM ARU Shared Service Request 1 */
#define SRC_ID_GTMARUIRQ2		671	/* GTM ARU Shared Service Request 2 */

#define SRC_ID_GTMBRCIRQ		672	/* GTM BRC Shared Service Request */
#define SRC_ID_GTMCMPIRQ		673	/* GTM CMP Shared Service Request */
#define SRC_ID_GTMSPE0IRQ		674	/* GTM SPE0 Shared Service Request */
#define SRC_ID_GTMSPE1IRQ		675	/* GTM SPE1 Shared Service Request */

#define SRC_ID_GTMPSM00			680	/* GTM PSM0 Shared Service Request 0 */
#define SRC_ID_GTMPSM01			681	/* GTM PSM0 Shared Service Request 1 */
#define SRC_ID_GTMPSM02			682	/* GTM PSM0 Shared Service Request 2 */
#define SRC_ID_GTMPSM03			683	/* GTM PSM0 Shared Service Request 3 */
#define SRC_ID_GTMPSM04			684	/* GTM PSM0 Shared Service Request 4 */
#define SRC_ID_GTMPSM05			685	/* GTM PSM0 Shared Service Request 5 */
#define SRC_ID_GTMPSM06			686	/* GTM PSM0 Shared Service Request 6 */
#define SRC_ID_GTMPSM07			687	/* GTM PSM0 Shared Service Request 7 */

#define SRC_ID_GTMDPLL0			704	/* GTM DPLL Service Request 0 */
#define SRC_ID_GTMDPLL1			705	/* GTM DPLL Service Request 1 */
#define SRC_ID_GTMDPLL2			706	/* GTM DPLL Service Request 2 */
#define SRC_ID_GTMDPLL3			707	/* GTM DPLL Service Request 3 */
#define SRC_ID_GTMDPLL4			708	/* GTM DPLL Service Request 4 */
#define SRC_ID_GTMDPLL5			709	/* GTM DPLL Service Request 5 */
#define SRC_ID_GTMDPLL6			710	/* GTM DPLL Service Request 6 */
#define SRC_ID_GTMDPLL7			711	/* GTM DPLL Service Request 7 */
#define SRC_ID_GTMDPLL8			712	/* GTM DPLL Service Request 8 */
#define SRC_ID_GTMDPLL9			713	/* GTM DPLL Service Request 9 */
#define SRC_ID_GTMDPLL10		714	/* GTM DPLL Service Request 10 */
#define SRC_ID_GTMDPLL11		715	/* GTM DPLL Service Request 11 */
#define SRC_ID_GTMDPLL12		716	/* GTM DPLL Service Request 12 */
#define SRC_ID_GTMDPLL13		717	/* GTM DPLL Service Request 13 */
#define SRC_ID_GTMDPLL14		718	/* GTM DPLL Service Request 14 */
#define SRC_ID_GTMDPLL15		719	/* GTM DPLL Service Request 15 */
#define SRC_ID_GTMDPLL16		720	/* GTM DPLL Service Request 16 */
#define SRC_ID_GTMDPLL17		721	/* GTM DPLL Service Request 17 */
#define SRC_ID_GTMDPLL18		722	/* GTM DPLL Service Request 18 */
#define SRC_ID_GTMDPLL19		723	/* GTM DPLL Service Request 19 */
#define SRC_ID_GTMDPLL20		724	/* GTM DPLL Service Request 20 */
#define SRC_ID_GTMDPLL21		725	/* GTM DPLL Service Request 21 */
#define SRC_ID_GTMDPLL22		726	/* GTM DPLL Service Request 22 */
#define SRC_ID_GTMDPLL23		727	/* GTM DPLL Service Request 23 */
#define SRC_ID_GTMDPLL24		728	/* GTM DPLL Service Request 24 */
#define SRC_ID_GTMDPLL25		729	/* GTM DPLL Service Request 25 */
#define SRC_ID_GTMDPLL26		730	/* GTM DPLL Service Request 26 */

#define SRC_ID_GTMERR			732	/* GTM Error Service Request */

#define SRC_ID_GTMTIM00			740	/* GTM TIM0 Shared Service Request 0 */
#define SRC_ID_GTMTIM01			741	/* GTM TIM0 Shared Service Request 1 */
#define SRC_ID_GTMTIM02			742	/* GTM TIM0 Shared Service Request 2 */
#define SRC_ID_GTMTIM03			743	/* GTM TIM0 Shared Service Request 3 */
#define SRC_ID_GTMTIM04			744	/* GTM TIM0 Shared Service Request 4 */
#define SRC_ID_GTMTIM05			745	/* GTM TIM0 Shared Service Request 5 */
#define SRC_ID_GTMTIM06			746	/* GTM TIM0 Shared Service Request 6 */
#define SRC_ID_GTMTIM07			747	/* GTM TIM0 Shared Service Request 7 */
#define SRC_ID_GTMTIM10			748	/* GTM TIM1 Shared Service Request 0 */
#define SRC_ID_GTMTIM11			749	/* GTM TIM1 Shared Service Request 1 */
#define SRC_ID_GTMTIM12			750	/* GTM TIM1 Shared Service Request 2 */
#define SRC_ID_GTMTIM13			751	/* GTM TIM1 Shared Service Request 3 */
#define SRC_ID_GTMTIM14			752	/* GTM TIM1 Shared Service Request 4 */
#define SRC_ID_GTMTIM15			753	/* GTM TIM1 Shared Service Request 5 */
#define SRC_ID_GTMTIM16			754	/* GTM TIM1 Shared Service Request 6 */
#define SRC_ID_GTMTIM17			755	/* GTM TIM1 Shared Service Request 7 */
#define SRC_ID_GTMTIM20			756	/* GTM TIM2 Shared Service Request 0 */
#define SRC_ID_GTMTIM21			757	/* GTM TIM2 Shared Service Request 1 */
#define SRC_ID_GTMTIM22			758	/* GTM TIM2 Shared Service Request 2 */
#define SRC_ID_GTMTIM23			759	/* GTM TIM2 Shared Service Request 3 */
#define SRC_ID_GTMTIM24			760	/* GTM TIM2 Shared Service Request 4 */
#define SRC_ID_GTMTIM25			761	/* GTM TIM2 Shared Service Request 5 */
#define SRC_ID_GTMTIM26			762	/* GTM TIM2 Shared Service Request 6 */
#define SRC_ID_GTMTIM27			763	/* GTM TIM2 Shared Service Request 7 */
#define SRC_ID_GTMTIM30			764	/* GTM TIM3 Shared Service Request 0 */
#define SRC_ID_GTMTIM31			765	/* GTM TIM3 Shared Service Request 1 */
#define SRC_ID_GTMTIM32			766	/* GTM TIM3 Shared Service Request 2 */
#define SRC_ID_GTMTIM33			767	/* GTM TIM3 Shared Service Request 3 */
#define SRC_ID_GTMTIM34			768	/* GTM TIM3 Shared Service Request 4 */
#define SRC_ID_GTMTIM35			769	/* GTM TIM3 Shared Service Request 5 */
#define SRC_ID_GTMTIM36			770	/* GTM TIM3 Shared Service Request 6 */
#define SRC_ID_GTMTIM37			771	/* GTM TIM3 Shared Service Request 7 */
#define SRC_ID_GTMTIM40			772	/* GTM TIM4 Shared Service Request 0 */
#define SRC_ID_GTMTIM41			773	/* GTM TIM4 Shared Service Request 1 */
#define SRC_ID_GTMTIM42			774	/* GTM TIM4 Shared Service Request 2 */
#define SRC_ID_GTMTIM43			775	/* GTM TIM4 Shared Service Request 3 */
#define SRC_ID_GTMTIM44			776	/* GTM TIM4 Shared Service Request 4 */
#define SRC_ID_GTMTIM45			777	/* GTM TIM4 Shared Service Request 5 */
#define SRC_ID_GTMTIM46			778	/* GTM TIM4 Shared Service Request 6 */
#define SRC_ID_GTMTIM47			779	/* GTM TIM4 Shared Service Request 7 */
#define SRC_ID_GTMTIM50			780	/* GTM TIM5 Shared Service Request 0 */
#define SRC_ID_GTMTIM51			781	/* GTM TIM5 Shared Service Request 1 */
#define SRC_ID_GTMTIM52			782	/* GTM TIM5 Shared Service Request 2 */
#define SRC_ID_GTMTIM53			783	/* GTM TIM5 Shared Service Request 3 */
#define SRC_ID_GTMTIM54			784	/* GTM TIM5 Shared Service Request 4 */
#define SRC_ID_GTMTIM55			785	/* GTM TIM5 Shared Service Request 5 */
#define SRC_ID_GTMTIM56			786	/* GTM TIM5 Shared Service Request 6 */
#define SRC_ID_GTMTIM57			787	/* GTM TIM5 Shared Service Request 7 */

#define SRC_ID_GTMMSC00			812	/* GTM MCS0 Shared Service Request 0 */
#define SRC_ID_GTMMSC01			813	/* GTM MCS0 Shared Service Request 1 */
#define SRC_ID_GTMMSC02			814	/* GTM MCS0 Shared Service Request 2 */
#define SRC_ID_GTMMSC03			815	/* GTM MCS0 Shared Service Request 3 */
#define SRC_ID_GTMMSC04			816	/* GTM MCS0 Shared Service Request 4 */
#define SRC_ID_GTMMSC05			817	/* GTM MCS0 Shared Service Request 5 */
#define SRC_ID_GTMMSC06			818	/* GTM MCS0 Shared Service Request 6 */
#define SRC_ID_GTMMSC07			819	/* GTM MCS0 Shared Service Request 7 */
#define SRC_ID_GTMMSC10			820	/* GTM MCS1 Shared Service Request 0 */
#define SRC_ID_GTMMSC11			821	/* GTM MCS1 Shared Service Request 1 */
#define SRC_ID_GTMMSC12			822	/* GTM MCS1 Shared Service Request 2 */
#define SRC_ID_GTMMSC13			823	/* GTM MCS1 Shared Service Request 3 */
#define SRC_ID_GTMMSC14			824	/* GTM MCS1 Shared Service Request 4 */
#define SRC_ID_GTMMSC15			825	/* GTM MCS1 Shared Service Request 5 */
#define SRC_ID_GTMMSC16			826	/* GTM MCS1 Shared Service Request 6 */
#define SRC_ID_GTMMSC17			827	/* GTM MCS1 Shared Service Request 7 */
#define SRC_ID_GTMMSC20			828	/* GTM MCS2 Shared Service Request 0 */
#define SRC_ID_GTMMSC21			829	/* GTM MCS2 Shared Service Request 1 */
#define SRC_ID_GTMMSC22			830	/* GTM MCS2 Shared Service Request 2 */
#define SRC_ID_GTMMSC23			831	/* GTM MCS2 Shared Service Request 3 */
#define SRC_ID_GTMMSC24			832	/* GTM MCS2 Shared Service Request 4 */
#define SRC_ID_GTMMSC25			833	/* GTM MCS2 Shared Service Request 5 */
#define SRC_ID_GTMMSC26			834	/* GTM MCS2 Shared Service Request 6 */
#define SRC_ID_GTMMSC27			835	/* GTM MCS2 Shared Service Request 7 */
#define SRC_ID_GTMMSC30			836	/* GTM MCS3 Shared Service Request 0 */
#define SRC_ID_GTMMSC31			837	/* GTM MCS3 Shared Service Request 1 */
#define SRC_ID_GTMMSC32			838	/* GTM MCS3 Shared Service Request 2 */
#define SRC_ID_GTMMSC33			839	/* GTM MCS3 Shared Service Request 3 */
#define SRC_ID_GTMMSC34			840	/* GTM MCS3 Shared Service Request 4 */
#define SRC_ID_GTMMSC35			841	/* GTM MCS3 Shared Service Request 5 */
#define SRC_ID_GTMMSC36			842	/* GTM MCS3 Shared Service Request 6 */
#define SRC_ID_GTMMSC37			843	/* GTM MCS3 Shared Service Request 7 */
#define SRC_ID_GTMMSC40			844	/* GTM MCS4 Shared Service Request 0 */
#define SRC_ID_GTMMSC41			845	/* GTM MCS4 Shared Service Request 1 */
#define SRC_ID_GTMMSC42			846	/* GTM MCS4 Shared Service Request 2 */
#define SRC_ID_GTMMSC43			847	/* GTM MCS4 Shared Service Request 3 */
#define SRC_ID_GTMMSC44			848	/* GTM MCS4 Shared Service Request 4 */
#define SRC_ID_GTMMSC45			849	/* GTM MCS4 Shared Service Request 5 */
#define SRC_ID_GTMMSC46			850	/* GTM MCS4 Shared Service Request 6 */
#define SRC_ID_GTMMSC47			851	/* GTM MCS4 Shared Service Request 7 */

