maxgerhardt/framework-aurduino/ShieldBuddyTC375/aurix/system/libaurix/include/intids_tc37x.h
#define SRC_ID_GTMTOM00			900	/* GTM TOM0 Shared Service Request 0 */
#define SRC_ID_GTMTOM01			901	/* GTM TOM0 Shared Service Request 1 */
#define SRC_ID_GTMTOM02			902	/* GTM TOM0 Shared Service Request 2 */
#define SRC_ID_GTMTOM03			903	/* GTM TOM0 Shared Service Request 3 */
#define SRC_ID_GTMTOM04			904	/* GTM TOM0 Shared Service Request 4 */
#define SRC_ID_GTMTOM05			905	/* GTM TOM0 Shared Service Request 5 */
#define SRC_ID_GTMTOM06			906	/* GTM TOM0 Shared Service Request 6 */
#define SRC_ID_GTMTOM07			907	/* GTM TOM0 Shared Service Request 7 */
#define SRC_ID_GTMTOM10			908	/* GTM TOM1 Shared Service Request 0 */
#define SRC_ID_GTMTOM11			909	/* GTM TOM1 Shared Service Request 1 */
#define SRC_ID_GTMTOM12			910	/* GTM TOM1 Shared Service Request 2 */
#define SRC_ID_GTMTOM13			911	/* GTM TOM1 Shared Service Request 3 */
#define SRC_ID_GTMTOM14			912	/* GTM TOM1 Shared Service Request 4 */
#define SRC_ID_GTMTOM15			913	/* GTM TOM1 Shared Service Request 5 */
#define SRC_ID_GTMTOM16			914	/* GTM TOM1 Shared Service Request 6 */
#define SRC_ID_GTMTOM17			915	/* GTM TOM1 Shared Service Request 7 */
#define SRC_ID_GTMTOM20			916	/* GTM TOM2 Shared Service Request 0 */
#define SRC_ID_GTMTOM21			917	/* GTM TOM2 Shared Service Request 1 */
#define SRC_ID_GTMTOM22			918	/* GTM TOM2 Shared Service Request 2 */
#define SRC_ID_GTMTOM23			919	/* GTM TOM2 Shared Service Request 3 */
#define SRC_ID_GTMTOM24			920	/* GTM TOM2 Shared Service Request 4 */
#define SRC_ID_GTMTOM25			921	/* GTM TOM2 Shared Service Request 5 */
#define SRC_ID_GTMTOM26			922	/* GTM TOM2 Shared Service Request 6 */
#define SRC_ID_GTMTOM27			923	/* GTM TOM2 Shared Service Request 7 */

#define SRC_ID_GTMATOM00		956	/* GTM ATOM0 Shared Service Request 0 */
#define SRC_ID_GTMATOM01		957	/* GTM ATOM0 Shared Service Request 1 */
#define SRC_ID_GTMATOM02		958	/* GTM ATOM0 Shared Service Request 2 */
#define SRC_ID_GTMATOM03		959	/* GTM ATOM0 Shared Service Request 3 */
#define SRC_ID_GTMATOM10		960	/* GTM ATOM1 Shared Service Request 0 */
#define SRC_ID_GTMATOM11		961	/* GTM ATOM1 Shared Service Request 1 */
#define SRC_ID_GTMATOM12		962	/* GTM ATOM1 Shared Service Request 2 */
#define SRC_ID_GTMATOM13		963	/* GTM ATOM1 Shared Service Request 3 */
#define SRC_ID_GTMATOM20		964	/* GTM ATOM2 Shared Service Request 0 */
#define SRC_ID_GTMATOM21		965	/* GTM ATOM2 Shared Service Request 1 */
#define SRC_ID_GTMATOM22		966	/* GTM ATOM2 Shared Service Request 2 */
#define SRC_ID_GTMATOM23		967	/* GTM ATOM2 Shared Service Request 3 */
#define SRC_ID_GTMATOM30		968	/* GTM ATOM3 Shared Service Request 0 */
#define SRC_ID_GTMATOM31		969	/* GTM ATOM3 Shared Service Request 1 */
#define SRC_ID_GTMATOM32		970	/* GTM ATOM3 Shared Service Request 2 */
#define SRC_ID_GTMATOM33		971	/* GTM ATOM3 Shared Service Request 3 */
#define SRC_ID_GTMATOM40		972	/* GTM ATOM4 Shared Service Request 0 */
#define SRC_ID_GTMATOM41		973	/* GTM ATOM4 Shared Service Request 1 */
#define SRC_ID_GTMATOM42		974	/* GTM ATOM4 Shared Service Request 2 */
#define SRC_ID_GTMATOM43		975	/* GTM ATOM4 Shared Service Request 3 */
#define SRC_ID_GTMATOM50		976	/* GTM ATOM5 Shared Service Request 0 */
#define SRC_ID_GTMATOM51		977	/* GTM ATOM5 Shared Service Request 1 */
#define SRC_ID_GTMATOM52		978	/* GTM ATOM5 Shared Service Request 2 */
#define SRC_ID_GTMATOM53		979	/* GTM ATOM5 Shared Service Request 3 */

#define SRC_ID_GTMMCSW0			1012	/* GTM Multi Channel Sequencer Service Request 0 */
#define SRC_ID_GTMMCSW1			1013	/* GTM Multi Channel Sequencer Service Request 1 */
#define SRC_ID_GTMMCSW2			1014	/* GTM Multi Channel Sequencer Service Request 2 */
#define SRC_ID_GTMMCSW3			1015	/* GTM Multi Channel Sequencer Service Request 3 */
#define SRC_ID_GTMMCSW4			1016	/* GTM Multi Channel Sequencer Service Request 4 */
#define SRC_ID_GTMMCSW5			1017	/* GTM Multi Channel Sequencer Service Request 5 */
#define SRC_ID_GTMMCSW6			1018	/* GTM Multi Channel Sequencer Service Request 6 */
#define SRC_ID_GTMMCSW7			1019	/* GTM Multi Channel Sequencer Service Request 7 */
#define SRC_ID_GTMMCSW8			1020	/* GTM Multi Channel Sequencer Service Request 8 */
#define SRC_ID_GTMMCSW9			1021	/* GTM Multi Channel Sequencer Service Request 9 */

#define IRQ_ID_MAX_NUM			1022


#endif /* __INTIDS_TC37X_H__ */
